# day-02-tip-calculator.py
# Калкулатор за сметка и бакшиш в ресторант

print ("=== Ресторантски калкулатор ===")

# Въвеждане на данни
bill = float(input("Колко е сметката (в лева)? "))
people = int(input("На колко души се дели сметката? "))
tip_percent = int(input("Колко процента бакшиш искате да оставите (напр. 10, 12, 15)? "))

# Изчисления

tip_amount = bill * (tip_percent / 100)
total = bill + tip_amount
per_person = total / people

# 3. Красиво показване с 2 знака след десетичната запетая
print(f"\nСметката:   {bill:.2f} лв.")
print(f"Бакшиш {tip_percent}%:  {tip_amount:.2f} лв.")
print(f"Общо:    {total:.2f} лв.")
print(f"На човек:   {per_person:.2f} лв.")
print("Приятна вечер! 🍽️")
