# =============================================
# ДЕН 4 – Познай числото (1 до 100)
# =============================================
import random

print("ИГРА: Познай числото!")
print("Аз намислих число от 1 до 100. Опитай да го познаеш\n")

# Компютърът избира тайно число
secret_number = random.randint(1,100)
try_it = 0

while True:
    # Потребителят въвежда догадка
    gues = int(input("Твоята догадка:  "))
    try_it +=1

    # 2. Проверка и подсказки
    if gues < secret_number:
        print("По-голямо!")
    elif gues > gues:
        print("По-малко!")
    else:
        # БИНГО! Позна!
        print(f"Браво! Позна за {try_it} опита!")
        if try_it <= 5:
            print("Ти си гений!")
        elif try_it <=8:
            print("Много добре!")
        else:
            print("Може и по-доре следващият път!")
        break   # излизаме от цикъла
# малко красота между опитите
    print("-" * 30)